---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NotAllPartsWereConvertedPlaceholdersWereAddedWarning
source: html/f33d0b25-dbfb-4974-0d01-aa3b7ba5ee5d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.NotAllPartsWereConvertedPlaceholdersWereAddedWarning Property

Not all parts were converted. Placeholders were added to fill the gaps. Check the fabrication service definition for the system.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotAllPartsWereConvertedPlaceholdersWereAddedWarning { get; }
```